---
type: AnalyticalEquipmentLoadData
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 8
tags: [revit-api, class]
---

# AnalyticalEquipmentLoadData

`Autodesk.Revit.DB.Electrical.AnalyticalEquipmentLoadData` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | ApparentLoad | 2023 | `public double ApparentLoad { get ; set ; }` |
| Property | Current | 2023 | `public double Current { get ; }` |
| Property | LoadClassification | 2023 | `public ElementId LoadClassification { get ; set ; }` |
| Property | LoadSet | 2024 | `public ElementId LoadSet { get ; set ; }` |
| Property | LoadType | 2023 | `public ElectricalLoadType LoadType { get ; }` |
| Property | PowerFactor | 2023 | `public double PowerFactor { get ; set ; }` |
| Property | TrueLoad | 2023 | `public double TrueLoad { get ; }` |
| Property | Voltage | 2023 | `public double Voltage { get ; set ; }` |